// OP-Lab2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <locale>
using namespace std;
int main()
{
    float a, b, c, d;
    setlocale(LC_CTYPE, "ukr");
    cout << " Числа а i b виражають довжини катетiв одного прямокутного трикутника,  с i d – іншого.З’ясувати, чи є цi трикутники подiбними.\n"; // умова задачі
    cout << " Введiть значення катетiв першого трикутника \n";
    cin >> a >> b;
    if (a < 0 || b < 0)
    {
        exit(1);
    }
    cout << " Введiть значення катетiв другого трикутника \n";
    cin >> c >> d;
    if (c < 0 || d < 0)
    {
        exit(1);
    }
    if (a / c == b / d) // Перевірка умови подібності прямокутних трикутників
    {
        cout << "Трикутники подiбнi";
    }
    else {
        cout << "Трикутники  не подiбнi";
    }
}
